# ４章練習問題

# 問 4.1
62.8 - 2.01 * 8.4/sqrt(50)
62.8 + 2.01 * 8.4/sqrt(50)

62.8 + c(-1,1)* 2.01 * 8.4/sqrt(50) # この表現も使える

62.8 - 1.96 * 8.4/sqrt(50)
62.8 + 1.96 * 8.4/sqrt(50)

# 問 4.2
# 標準版 (A)
62.2 - 1.96 * 11.0/sqrt(32)
62.2 + 1.96 * 11.0/sqrt(32)
# 改訂版 (B) 
71.4 - 1.96 * 10.8/sqrt(35)
71.4 + 1.96 * 10.8/sqrt(35)
#
62.2 - qt(0.975,31) * 11.0/sqrt(32)
62.2 + qt(0.975,31) * 11.0/sqrt(32)
#
71.4 - qt(0.975,34) * 10.8/sqrt(35)
71.4 + qt(0.975,34) * 10.8/sqrt(35)

# 問 4.3
32.8 - 1.96 * 29.5/sqrt(2500)
32.8 + 1.96 * 29.5/sqrt(2500)

# 問 4.4
# (1)
p.hat <- 1500/2500 ; q.hat <- 1-p.hat ; n <- 2500
p.hat - 1.96 * sqrt(p.hat * q.hat/n)
p.hat + 1.96 * sqrt(p.hat * q.hat/n)

# (2)
N <- 100000 ; n <- 2500
(fpc <- (N-n)/(N-1))
1 - n/N
p.hat - 1.96 * sqrt(fpc * p.hat * q.hat/n)
p.hat + 1.96 * sqrt(fpc * p.hat * q.hat/n)

# (3)
fpc <- 1-2500/5000
p.hat - 1.96 * sqrt(fpc * p.hat * q.hat/n)
p.hat + 1.96 * sqrt(fpc * p.hat * q.hat/n)


# 問 4.5 （外れ値を除いたデータセットを作成する）
height <- read.table("height.txt",header=T)
height2 <- subset(height,father > 159)
attach(height2)

# (1)
sw <- sqrt( ((18-1)*5.84^2 + (18-1)*5.45^2 )/34) 
# sw^2 : こみにした分散の推定値 pooled variance
(171.0 - 167.94) - qt(0.975,df=34) *sw * sqrt(1/18+1/18)
(171.0 - 167.94) + qt(0.975,df=34) *sw * sqrt(1/18+1/18)
# 以下は参考
t.test(son,father,var.equal=T) # 検定の出力にも信頼区間が表示される
t.test(son,father) # Welch の検定

# (2)
sd <- sqrt(34.12 - 2* 24.71 + 29.70)
(171.0 - 167.94) - qt(0.975,df=17) * sd /sqrt(18)
(171.0 - 167.94) + qt(0.975,df=17) * sd /sqrt(18)

# sd <- sqrt(34.11765 - 2* 24.70588 + 29.70261)
# 有効数字を比較するための参考例
t.test(son,father,paired=T) # 元の観測値があれば，これで対比較ができる

# (3)
r <- cor(son,father)
z <- (1/2) * log( (1+r)/(1-r) )
tanh( z + c(-1,1)*1.96 /sqrt(18-3) )

# 問 4.6 
# (1)
144.7 +c(-1,1)* 1.96 * 20.85 /sqrt(150)
155.6 +c(-1,1)* 1.96 * 21.91 /sqrt(150)
# qt(.975,df=149)

# (2)
qchisq(c(.05,.975),df=149)
# 121.8 <= {(149)* 434.537}/{sigma^2} <= 184.7
(149) * 434.537 / c(184.7,121.8)
(149) * 480.098 / c(184.7,121.8)

# (3)
sw <- sqrt( ((150-1)*434.537 + (150-1)*480.098 )/298) 
# sw^2 : こみにした分散の推定値 pooled variance
(144.75 - 155.57) + c(-1,1)* qt(0.975,df=298) * sw * sqrt(1/150+1/150)

# (4)
# bar_d= -10.83, s_d= 3.891， n=5
qt(.975,df=4)
-10.83 + c(-1,1) * qt(.975,df=4) * 3.891/sqrt(5) 

